### DataFrame
A tabular datasturcture with rows and columns(2D) similar to excel spreadsheet

In [25]:
import pandas as pd

In [26]:
data= {'Name': ['Rolex', 'Leo', "Dilli"], 'Age': [20,25,30]}

df=pd.DataFrame(data, index=['Employee1', 'Employee2', 'Employee3'])  
df

            Name  Age
Employee1  Rolex   20
Employee2    Leo   25
Employee3  Dilli   30

In [27]:
print(df.loc['Employee2'])

print()
print(df.iloc[0])

Name    Leo
Age      25
Name: Employee2, dtype: object

Name    Rolex
Age        20
Name: Employee1, dtype: object

Adding a new column

In [28]:
df['Job']= ["Drug boss", "Datura mafia", 'Kaithi']
df

            Name  Age           Job
Employee1  Rolex   20     Drug boss
Employee2    Leo   25  Datura mafia
Employee3  Dilli   30        Kaithi

Creating a new row

In [29]:
new_row= pd.DataFrame([{'Name': 'Napolean', 'Age': '59', 'Job': 'Police'}] , index= ['Employee4'])
df=pd.concat([df, new_row])
df

               Name Age           Job
Employee1     Rolex  20     Drug boss
Employee2       Leo  25  Datura mafia
Employee3     Dilli  30        Kaithi
Employee4  Napolean  59        Police

Creating new rows

In [30]:
new_row= pd.DataFrame([{'Name': 'Harold', 'Age': '50', 'Job': 'Second datura boss'},{'Name': 'Antony', 'Age': '55', 'Job': 'DAS & Co boss'}], index=['Employee5', 'Employee6'] )
df=pd.concat([df, new_row])
df

               Name Age                 Job
Employee1     Rolex  20           Drug boss
Employee2       Leo  25        Datura mafia
Employee3     Dilli  30              Kaithi
Employee4  Napolean  59              Police
Employee5    Harold  50  Second datura boss
Employee6    Antony  55       DAS & Co boss